### Text for initial Commands ###
# English
cmdStart_en = '''👋🏼 Hey, {}!
This bot is designed to check the number of online players and the availability of CS:GO servers.

For more information type /help.'''
cmdHelp_en = '''<a href="https://telegra.ph/Detailed-description-03-07">‎‎‎‎</a>ℹ️ This bot is designed by @csgobeta. Source code on <a href="https://github.com/csgobeta/csgobetabot">GitHub</a>.

telegra.ph/Detailed-description-03-07'''
cmdFeedback_en = '''💬 Please, tell us about your <b>suggestions</b> or <b>problems</b> that you have encountered using our bot.

Use /cancel to cancel this command.'''
# Russian
cmdStart_ru = '''👋🏼 Привет, {}!
Этот бот предназначен для проверки количества онлайн игроков и доступности CS:GO серверов.

Для большей информации воспользуйтесь /help.'''
cmdHelp_ru = '''<a href="https://telegra.ph/Podrobnoe-opisanie-03-07">‎‎‎‎‎‎‎</a>ℹ️ Этот бот разработан каналом @csgobeta. Исходный код на <a href="https://github.com/csgobeta/csgobetabot">GitHub</a>.

telegra.ph/Podrobnoe-opisanie-03-07'''
cmdFeedback_ru = '''💬 Пожалуйста, расскажите о Ваших <b>пожеланиях</b> или <b>проблемах</b>, с которыми Вы столкнулись, используя бота.

Используйте /cancel, чтобы отменить команду.'''


### Text for Status ###
# English
status_en = '''{} <b>CS:GO service status:</b>

• Game coordinator: {}
• Server connection: {}
• Matchmaking scheduler: {}
• Player inventories: {}
• Steam web API: {}

Updated on: {} UTC'''
# Russian
status_ru = '''{} <b>Состояние служб CS:GO:</b>

• Игровой координатор: {}
• Подключение к серверам: {}
• Планировщик матчмейкинга: {}
• Инвентари игроков: {}
• Steam веб-API: {}

Обновлено: {} UTC'''


### Text for Matchmaking ###
# English
mm_en = '''<a href="{}">‎‎‎‎</a>📊 <b>Matchmaking statistics:</b>

• Online servers: {:,}
• Online players: {:,}
• Active players: {:,}
• Players searching: {:,}
• Average search time: {}s'''
# Russian
mm_ru = '''<a href="{}">‎‎‎‎</a>⁠📊 <b>Статистика матчмейкинга:</b>

• Онлайн серверов: {:,}
• Онлайн игроков: {:,}
• Активных игроков: {:,}
• Игроков в поиске: {:,}
• Среднее время поиска: {} с.'''


### Text for Additional info ###
# English
additionalInfo_en = '''📁 <b>Additional information:</b>

• 24-hour peak: {:,}
• All-time peak: {:,}
• Monthly unique players: {:,}

Updated on: {} UTC'''
# Russian
additionalInfo_ru = '''📁 <b>Дополнительная информация:</b>

• 24-часовой пик: {:,}
• Рекордный пик: {:,}
• Ежемесячные уникальные игроки: {:,}

Обновлено: {} UTC'''


### Text for Dev count ###
# English
devCount_en = '''<a href="{}">⁠‎‎‎</a>🧑‍💻 <b>Beta-version of CS:GO (ID710):</b>

• Online developers: {}
• All-time peak: {}

Updated on: {} UTC

🏢 Current time at Valve headquarters: {} PDT'''
# Russian
devCount_ru = '''<a href="{}">⁠‎‎‎</a>🧑‍💻 <b>Бета-версия CS:GO (ID710):</b>

• Онлайн разработчиков: {}
• Рекордный пик: {}

Обновлено: {} UTC

🏢 Текущее время в штаб-квартире Valve: {} PDT'''


### Text for Timer ###
# English
timer_en = '⏳ Time left until experience and drop cap reset: {}d {}h {}m {}s'
# Russian
timer_ru = '⏳ Время до сброса ограничений опыта и дропа: {} д. {} ч. {} м. {} с.'


### Text for Game Version ###
# English
gameversion_en = '''⚙️ Current game version: <code>{} ({}/{})</code>

Latest CS:GO update: {} UTC'''
# Russian
gameversion_ru = '''⚙️ Текущая версия игры: <code>{} ({}/{})</code>

Последнее обновление CS:GO: {} UTC'''


### URL examples ###
# English
url_ex_en = '''📖 Please, enter one of the following options:
        
• Profile URL (ex: https://steamcommunity.com/id/csgobetaN2)
• Steam ID (ex: 76561199148006660)
• Custom URL (ex: csgobetaN1)

Use /cancel to cancel this command.'''
# Russian
url_ex_ru = '''🔗 Пожалуйста, введите один из следующих вариантов:

• Ссылка на профиль (напр.: https://steamcommunity.com/id/csgobetaN2)
• Steam ID (напр.: 76561199148006660)
• Личная ссылка (напр.: csgobetaN1)

Используйте /cancel, чтобы отменить команду.'''


### Profile information ###
# English
bans_en = '''🔍 <b>General profile information:</b>

• Custom URL: <code>{}</code>
• Steam ID: <code>{}</code>
• Account ID: <code>{}</code>
• Steam2 ID: <code>{}</code>
• Steam3 ID: <code>{}</code>
• Invite URL: {}
• CS:GO friend code: <code>{}</code>
• FACEIT: {}

📛 <b>Bans and restrictions:</b>

• Game bans: {}
• VAC bans: {}
• Community ban: {}
• Trade ban: {}
• FACEIT ban: {}'''
# Russian
bans_ru = '''🔍 <b>Общая информация профиля:</b>

• Личная ссылка: <code>{}</code>
• Steam ID: <code>{}</code>
• Account ID: <code>{}</code>
• Steam2 ID: <code>{}</code>
• Steam3 ID: <code>{}</code>
• Пригласительная ссылка: {}
• Код друга CS:GO: <code>{}</code>
• FACEIT: {}

📛 <b>Запреты и ограничения:</b>

• Игровые баны: {}
• VAC баны: {}
• Бан в сообществе: {}
• Трейд бан: {}
• Бан на FACEIT: {}'''


### In-game stats ###
# English
stats_en = '''<p><code>Generated using <a href="https://t.me/csgobetabot">@csgobetabot</a> ❤️</code></p>
<h3>📊 General in-game statistics:</h3>
<ul><li>Playtime (matchmaking): <b>{:,}</b>h</li><li>Kills: <b>{:,}</b></li><li>Deaths: <b>{:,}</b></li><li>K/D ratio: <b>{}</b></li></ul><br>
<ul><li>Matches played: <b>{:,}</b></li><li>Matches won: <b>{:,}</b></li><li>Win percentage: <b>{}</b>%</li><li>Rounds played: <b>{:,}</b></li><li>Pistol rounds won: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Shooting statistics:</h3>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li><li>Headshot accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🗺️ Map statistics:</h3>
<ul><li>Best map: <b>{}</b></li><li>Win percentage: <b>{}</b>%</li></ul>
<hr>
<h3>🔰 Misc:</h3>
<ul><li>MVPs: <b>{:,}</b></li><li>Money earned: <b>{:,}</b>$</li><li>Hostages rescued: <b>{:,}</b></li><li>Weapons donated: <b>{:,}</b></li><li>Windows broken: <b>{:,}</b></li></ul><br>
<ul><li>Damage done: <b>{:,}</b></li><li>Bombs planted: <b>{:,}</b></li><li>Bombs defused: <b>{:,}</b></li></ul><br>
<ul><li>Knife kills: <b>{:,}</b></li><li>HE grenade kills: <b>{:,}</b></li><li>Molotov kills: <b>{:,}</b></li></ul><br>
<ul><li>Zeus shots: <b>{:,}</b></li><li>Zeus kills: <b>{:,}</b></li><li>Zeus fire accuracy: <b>{}</b>%</li></ul><br>
<ul><li>Knife fights won: <b>{:,}</b></li><li>Kills with enemy weapons: <b>{:,}</b></li><li>Blind enemies killed: <b>{:,}</b></li><li>Zoomed snipers killed: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Gun statistics:</h3>
<h4>AK-47:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>M4A4 / M4A1-S:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>AWP:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Pistol statistics:</h3>
<h4>Glock-18:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>USP-S / P2000:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>P250:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Dual Berettas:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Five-SeveN / CZ75-Auto:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Tec-9 / CZ75-Auto:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Desert Eagle / R8 Revolver:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 SMG statistics:</h3>
<h4>MAC-10:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>MP7 / MP5-SD:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>MP9:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>UMP-45:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>PP-Bizon:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>P90:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Rifle statistics:</h3>
<h4>Famas:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Galil AR:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>AUG:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>SG 553:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Sniper rifle statistics:</h3>
<h4>SSG 08:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>SCAR-20:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>G3SG1:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Heavy gun statistics:</h3>
<h4>Nova:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>MAG-7:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Sawed-Off:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>XM1014:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>Negev:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>
<h4>M249:</h4>
<ul><li>Shots: <b>{:,}</b></li><li>Hits: <b>{:,}</b></li><li>Kills: <b>{:,}</b></li><li>Fire accuracy: <b>{}</b>%</li></ul>'''
# Russian
stats_ru = '''<p><code>Cгенерировано с помощью <a href="https://t.me/csgobetabot">@csgobetabot</a> ❤️</code></p>
<h3>📊 Общая игровая статистика:</h3>
<ul><li>Время в игре (матчмейкинг): <b>{:,}</b> ч.</li><li>Убийств: <b>{:,}</b></li><li>Смертей: <b>{:,}</b></li><li>Соотношение У/С: <b>{}</b></li></ul>
<ul><li>Матчей сыграно: <b>{:,}</b></li><li>Матчей выиграно: <b>{:,}</b></li><li>Процент побед: <b>{}</b>%</li><li>Раундов сыграно: <b>{:,}</b></li><li>Пистолетных раундов выиграно: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Статистика стрельбы:</h3>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li><li>Процент попаданий в голову: <b>{}</b>%</li></ul>
<hr>
<h3>🗺️ Статистика карт:</h3>
<ul><li>Лучшая карта: <b>{}</b></li><li>Процент побед: <b>{}</b>%</li></ul>
<hr>
<h3>🔰 Прочее:</h3>
<ul><li>Наград СЦИ: <b>{:,}</b></li><li>Денег заработано: <b>{:,}</b>$</li><li>Заложников спасено: <b>{:,}</b></li><li>Оружий выброшено: <b>{:,}</b></li><li>Разбито окон: <b>{:,}</b></li></ul><br>
<ul><li>Нанесено урона: <b>{:,}</b></li><li>Бомб установлено: <b>{:,}</b></li><li>Бомб обезврежено: <b>{:,}</b></li></ul><br>
<ul><li>Убийств ножом: <b>{:,}</b></li><li>Убийств гранатой: <b>{:,}</b></li><li>Убийств «коктейлем Молотова»: <b>{:,}</b></li></ul><br>
<ul><li>Выстрелов из Zeus: <b>{:,}</b></li><li>Убийств из Zeus: <b>{:,}</b></li><li>Точность попаданий из Zeus: <b>{}</b>%</li></ul><br>
<ul><li>Выиграно поедников на ножах: <b>{:,}</b></li><li>Убийств из вражеского оружия: <b>{:,}</b></li><li>Ослепленных врагов убито: <b>{:,}</b></li><li>Убито прицелившихся снайперов: <b>{:,}</b></li></ul>
<hr>
<h3>🔫 Статистика оружий:</h3>
<h4>AK-47:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>M4A4 / M4A1-S:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>AWP:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика пистолетов:</h3>
<h4>Glock-18:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>USP-S / P2000:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>P250:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Dual Berettas:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Five-SeveN / CZ75-Auto:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Tec-9 / CZ75-Auto:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Desert Eagle / R8 Revolver:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика пистолетов-пулемётов:</h3>
<h4>MAC-10:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>MP7 / MP5-SD:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>MP9:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>UMP-45:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>PP-Bizon:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>P90:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика винтовок:</h3>
<h4>Famas:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Galil AR:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>AUG:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>SG 553:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика снайперских винтовок:</h3>
<h4>SSG 08:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>SCAR-20:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>G3SG1:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<hr>
<h3>🔫 Статистика тяжёлых оружий:</h3>
<h4>Nova:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>MAG-7:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Sawed-off:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>XM1014:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>Negev:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>
<h4>M249:</h4>
<ul><li>Выстрелов: <b>{:,}</b></li><li>Попаданий: <b>{:,}</b></li><li>Убийств: <b>{:,}</b></li><li>Точность стрельбы: <b>{}</b>%</li></ul>'''


### Text for Wrong Request ###
# English
unknownRequest_en = '⚠️ Nothing found, please use of the following buttons:'
# Russian
unknownRequest_ru = '⚠️ Ничего не найдено, пожалуйста, воспользуйтесь одной из приведённых кнопок:'


### Text for Wrong API ###
# English
wrongAPI_en = '💀 Issues with Steam API, please try again later.'
# Russian
wrongAPI_ru = '💀 Проблемы с Steam API, пожалуйста, попробуйте позже.'


### Text for Maintenance ###
# English
maintenance_en = '🛠️ Steam servers are down for the weekly maintenance, please try again later.'
# Russian
maintenance_ru = '🛠️ Сервера Steam отключены для еженедельного тех. обслуживания, пожалуйста, попробуйте позже.'


### Text if something is wrong ###
# English
wrongBOT_en = '🧐 Sorry, something’s not right. Please try again later.'
# Russian
wrongBOT_ru = '🧐 Извините, что-то не так. Пожалуйста, попробуйте позже.'


### Text for new BuildID ###
# Russian
notiNewBuild_ru = '''⚡️ Обнаружено новое обновление Counter-Strike: Global Offensive. Пост со списком изменений выйдет в ближайшее время.

ID новой сборки: <code>{}</code>'''


### Text for new DPR BuildID ###
# Russian
notiNewDPRBuild_ru = '''🔒 Защищённая паролем DPR* сборка CS:GO была обновлена. Это может означать, что в скором времени выйдет новое обновление.

<i>*DPR — developer pre-release</i>

ID новой сборки: <code>{}</code>'''


### Text for Workshop Changes ###
# Russian
notiNewMap_ru = '''🆕 Официальный аккаунт CS:GO в Steam загрузил карту <b>{}</b> в Мастерскую для совместимости с будущими версиями игры.

В последующих обновлениях игры стоит ожидать некоторые изменения на данной карте.

🔗 steamcommunity.com/sharedfiles/filedetails/?id={}'''

notiNewMaps_ru = '''🆕 Официальный аккаунт CS:GO в Steam загрузил карты <b>{}</b> в Мастерскую для совместимости с будущими версиями игры.

В последующих обновлениях игры стоит ожидать некоторые изменения на данных картах.

🔗 steamcommunity.com/profiles/76561198082857351/myworkshopfiles/'''


### Text for new Player Peak ###
# Russian
notiNewPlayerPeak_ru = '''🤩 Зарегистрирован новый рекордный пик онлайн игроков в Counter-Strike: Global Offensive.

Количество игроков: {}'''


### Text for new Dev Peak ###
# Russian
notiNewDevPeak_ru = '''🔍 Зарегистрирован новый рекордный пик онлайн разработчиков в бета-версии Counter-Strike: Global Offensive.

Количество разработчиков: {}'''


### Text for new Tweet ###
# Russian
notiNewTweet_ru = '''💬 Официальный аккаунт CS:GO в Twitter:

«{}»

🔗 twitter.com/csgo/status/{}'''


### Text for DC ###
# English
dc_africa_en = '''🇿🇦 South Africaʼs DC status:

• Location: Johannesburg
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_australia_en = '''🇦🇺 Australiaʼs DC status:

• Location: Sydney
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_north_eu_en = '''🇸🇪 Swedenʼs DC status:

• Location: Stockholm
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_west_eu_en = '''🇩🇪 Germanyʼs DC status:

• Location: Frankfurt
• Load: {}
• Capacity: {}

🇪🇸 Spainʼs DC status:

• Location: Mardid
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_east_eu_en = '''🇦🇹 Austriaʼs DC status:

• Location: Vienna
• Load: {}
• Capacity: {}

🇵🇱 Polandʼs DC status:

• Location: Warsaw
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_north_us_en = '''🇺🇸 Northcentral DC status:

• Location: Chicago
• Load: {}
• Capacity: {}

🇺🇸 Northeast DC status:

• Location: Sterling
• Load: {}
• Capacity: {}

🇺🇸 Northwest DC status:

• Location: Moses Lake
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_south_us_en = '''🇺🇸 Southwest DC status:

• Location: Los Angeles
• Load: {}
• Capacity: {}

🇺🇸 Southeast DC status:

• Location: Atlanta
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_south_america_en = '''🇧🇷 Brazilʼs DC status:

• Location: Sao Paulo
• Load: {}
• Capacity: {}

🇨🇱 Chileʼs DC status:

• Location: Santiago
• Load: {}
• Capacity: {}

🇵🇪 Peruʼs DC status:

• Location: Lima
• Load: {}
• Capacity: {}

🇦🇷 Argentinaʼs DC Status:

• Location: Buenos Aires
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_india_en = '''🇮🇳 Indiaʼs DC status:

• Location: Mumbai
• Load: {}
• Capacity: {}

• Location: Chennai
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_japan_en = '''🇯🇵 Japanʼs DC status:

• Location: Tokyo
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_china_en = '''🇨🇳 Chinaʼs DC status:

• Location: Shanghai
• Load: {}
• Capacity: {}

• Location: Tianjin
• Load: {}
• Capacity: {}

• Location: Guangzhou
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_emirates_en = '''🇦🇪 Emiratesʼ DC status:

• Location: Dubai
• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_singapore_en = '''🇸🇬 Singaporeʼs DC status:

• Load: {}
• Capacity: {}

Updated on: {} UTC'''

dc_hong_kong_en = '''🇭🇰 Hong Kongʼs DC status:

• Load: {}
• Capacity: {}

Updated on: {} UTC'''
# Russian
dc_africa_ru = '''🇿🇦 Состояние дата-центра Южной Африки:

• Расположение: Йоханнесбург
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''
dc_australia_ru = '''🇦🇺 Состояние дата-центра Австралии:

• Расположение: Сидней
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_north_eu_ru = '''🇸🇪 Состояние дата-центра Швеции:

• Расположение: Стокгольм
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_west_eu_ru = '''🇩🇪 Состояние дата-центра Германии:

• Расположение: Франкфурт
• Загруженность: {}
• Доступность: {}

🇪🇸 Состояние дата-центра Испании:

• Расположение: Мадрид
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_east_eu_ru = '''🇦🇹 Состояние дата-центра Австрии:

• Расположение: Вена
• Загруженность: {}
• Доступность: {}

🇵🇱 Состояние дата-центра Польши:

• Расположение: Варшава
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_north_us_ru = '''🇺🇸 Состояние северо-центрального дата-центра:

• Расположение: Чикаго
• Загруженность: {}
• Доступность: {}

🇺🇸 Состояние северо-восточного дата-центра:

• Расположение: Стерлинг
• Загруженность: {}
• Доступность: {}

🇺🇸 Состояние северо-западного дата-центра:

• Расположение: Мозес Лейк
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_south_us_ru = '''🇺🇸 Состояние юго-западного дата-центра:

• Расположение: Лос-Анджелес
• Загруженность: {}
• Доступность: {}

🇺🇸 Состояние юго-восточного дата-центра:

• Расположение: Атланта
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_south_america_ru = '''🇧🇷 Состояние дата-центра Бразилии:

• Расположение: Сан-Паулу
• Загруженность: {}
• Доступность: {}

🇨🇱 Состояние дата-центра Чили:

• Расположение: Сантьяго
• Загруженность: {}
• Доступность: {}

🇵🇪 Состояние дата-центра Перу:

• Расположение: Лима
• Загруженность: {}
• Доступность: {}

🇦🇷 Состояние дата-центра Аргентины:

• Расположение: Буэнос-Айрес
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_india_ru = '''🇮🇳 Состояние дата-центров Индии:

• Расположение: Мумбаи
• Загруженность: {}
• Доступность: {}

• Расположение: Ченнай
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_japan_ru = '''🇯🇵 Состояние дата-центра Японии:

• Расположение: Токио
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_china_ru = '''🇨🇳 Состояние дата-центров Китая:

• Расположение: Шанхай
• Загруженность: {}
• Доступность: {}

• Расположение: Тяньцзинь
• Загруженность: {}
• Доступность: {}

• Расположение: Гуанчжоу
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_emirates_ru = '''🇦🇪 Состояние дата-центра Эмиратов:

• Расположение: Дубай
• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_singapore_ru = '''🇸🇬 Состояние дата-центра Сингапура:

• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''

dc_hong_kong_ru = '''🇭🇰 Состояние дата-центра Гонконга:

• Загруженность: {}
• Доступность: {}

Обновлено: {} UTC'''


"""Text for Guns"""
# Russian
gun_data_ru = '''🗂 Детальная информация про {}:

• Происхождение: {}
• Стоимость: {}$
• Обойма: {}/{}
• Скорострельность: {} в/м.
• Награда за убийство: {}$
• Мобильность: {} ед.

• Бронепробиваемость: {}%
• Дальность поражения (стоя / сидя): {} / {} м.

• Время, за которое достаётся оружие: {} с.
• Перезарядка: {} / {} с.
(готовность обоймы / готовность к стрельбе)

💢 Информация об уроне:
(противник в броне / без брони)

• Голова: {} / {}
• Грудь и руки: {} / {}
• Живот: {} / {}
• Ноги: {} / {}'''
# English
gun_data_en = '''🗂 Detailed information about {}:

• Origin: {}
• Cost: ${}
• Clip size: {}/{}
• Fire rate: {} RPM
• Kill reward: ${}
• Movement speed: {} units

• Armor penetration: {}%
• Range accuracy (stand / crouch): {}m / {}m

• Draw time: {}s
• Reload time: {}s / {}s
(clip ready / fire ready)

💢 Damage information:
(enemy with armor / without armor)

• Head: {} / {}
• Chest and arms: {} / {}
• Stomach: {} / {}
• Legs: {} / {}'''
